In [ ]:
"""find the average salary of current employees(to_date = '9999-01-01' ), exluding the highest and lowest salary"""

In [ ]:
"""SQL table creation and data insertion"""
drop table if exists  `salaries` ; 
CREATE TABLE `salaries` (
`emp_no` int(11) NOT NULL,
`salary` float(11,3) NOT NULL,
`from_date` date NOT NULL,
`to_date` date NOT NULL,
PRIMARY KEY (`emp_no`,`from_date`));

INSERT INTO salaries VALUES(10001,85097,'2001-06-22','2002-06-22');
INSERT INTO salaries VALUES(10001,88958,'2002-06-22','9999-01-01');
INSERT INTO salaries VALUES(10002,72527,'2001-08-02','9999-01-01');
INSERT INTO salaries VALUES(10003,43699,'2000-12-01','2001-12-01');
INSERT INTO salaries VALUES(10003,43311,'2001-12-01','9999-01-01');
INSERT INTO salaries VALUES(10004,70698,'2000-11-27','2001-11-27');
INSERT INTO salaries VALUES(10004,74057,'2001-11-27','9999-01-01');

In [ ]:
"""SQL solution"""
# 1
SELECT AVG(salary)
FROM salaries
WHERE to_date = '9999-01-01'
AND salary NOT IN (SELECT MAX(salary) FROM salaries WHERE to_date = '9999-01-01')
AND salary NOT IN (SELECT MIN(salary) FROM salaries WHERE to_date = '9999-01-01')

# 2
SELECT AVG(salary)
FROM salaries
WHERE to_date = '9999-01-01'
AND salary != (SELECT MAX(salary) FROM salaries WHERE to_date = '9999-01-01')
AND salary != (SELECT MIN(salary) FROM salaries WHERE to_date = '9999-01-01')

# 3
SELECT (SUM(salary) - MAX(salary) - MIN(salary))/(COUNT(1) - 2) AS average
FROM salaries
WHERE to_date = '9999-01-01'

In [2]:
"""pandas dataframe creation"""
import pandas as pd
# read records from a txt file
salaries = pd.read_csv('data.txt', header=None)
salaries.columns = ['emp_no', 'salary', 'from_date', 'to_date']
salaries.head()

                              emp_no  salary     from_date         to_date
0  INSERT INTO salaries VALUES(10001   85097  '2001-06-22'  '2002-06-22');
1  INSERT INTO salaries VALUES(10001   88958  '2002-06-22'  '9999-01-01');
2  INSERT INTO salaries VALUES(10002   72527  '2001-08-02'  '9999-01-01');
3  INSERT INTO salaries VALUES(10003   43699  '2000-12-01'  '2001-12-01');
4  INSERT INTO salaries VALUES(10003   43311  '2001-12-01'  '9999-01-01');

In [4]:
# clean the records
salaries['emp_no'] = salaries['emp_no'].str[-5:]
salaries['from_date'] = salaries['from_date'].str[1:-1]
salaries['to_date'] = salaries['to_date'].str[1:-3]
salaries.head()

  emp_no  salary from_date     to_date
0  10001   85097  001-06-2  2002-06-22
1  10001   88958  002-06-2  9999-01-01
2  10002   72527  001-08-0  9999-01-01
3  10003   43699  000-12-0  2001-12-01
4  10003   43311  001-12-0  9999-01-01

In [5]:
salaries[(salaries['to_date'] == '9999-01-01') & (salaries['salary'] != salaries['salary'].max()) & (salaries['salary'] != salaries['salary'].min())]['salary'].mean()

73292.0